In [1]:
import numpy as np
import pandas as pd

In [2]:
df1 = pd.read_csv('train.csv')

In [3]:
df1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df1.drop(['PassengerId','Name','Ticket','Cabin','Parch','SibSp'],axis=1 ,inplace=True)

In [5]:
df1.head()

   Survived  Pclass     Sex   Age     Fare Embarked
0         0       3    male  22.0   7.2500        S
1         1       1  female  38.0  71.2833        C
2         1       3  female  26.0   7.9250        S
3         1       1  female  35.0  53.1000        S
4         0       3    male  35.0   8.0500        S

In [6]:
df1.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
Fare          0
Embarked      2
dtype: int64

In [7]:
df1['Age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [8]:
df1['Age'].fillna(df1['Age'].mean(),inplace =True)

In [9]:
l_sex_dummies = pd.get_dummies(df1['Sex'],drop_first =True)

In [10]:
df1.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
Fare        0
Embarked    2
dtype: int64

In [11]:
df1['Embarked'].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

In [13]:
df1 = pd.concat([df1,l_sex_dummies],axis=1)

In [14]:
df1.head()

   Survived  Pclass     Sex   Age     Fare Embarked  male
0         0       3    male  22.0   7.2500        S     1
1         1       1  female  38.0  71.2833        C     0
2         1       3  female  26.0   7.9250        S     0
3         1       1  female  35.0  53.1000        S     0
4         0       3    male  35.0   8.0500        S     1

In [15]:
df1.drop('Sex',axis =1,inplace =True)

In [16]:
df1.head()

   Survived  Pclass   Age     Fare Embarked  male
0         0       3  22.0   7.2500        S     1
1         1       1  38.0  71.2833        C     0
2         1       3  26.0   7.9250        S     0
3         1       1  35.0  53.1000        S     0
4         0       3  35.0   8.0500        S     1

In [27]:
df1.drop('Embarked',axis=1,inplace=True)

In [28]:
df1.head()

   Survived  Pclass   Age     Fare  male
0         0       3  22.0   7.2500     1
1         1       1  38.0  71.2833     0
2         1       3  26.0   7.9250     0
3         1       1  35.0  53.1000     0
4         0       3  35.0   8.0500     1

In [29]:
from sklearn.preprocessing import StandardScaler

In [31]:
sts = StandardScaler()

In [32]:
feature_scale = ['Age' , 'Fare']
df1[feature_scale] = sts.fit_transform(df1[feature_scale])

In [33]:
df1.head()

   Survived  Pclass       Age      Fare  male
0         0       3 -0.592481 -0.502445     1
1         1       1  0.638789  0.786845     0
2         1       3 -0.284663 -0.488854     0
3         1       1  0.407926  0.420730     0
4         0       3  0.407926 -0.486337     1

In [34]:
X = df1.drop('Survived',axis =1)
y = df1['Survived']

In [35]:
from sklearn.linear_model import LogisticRegression

In [36]:
logmodel = LogisticRegression()
logmodel.fit(X,y)

LogisticRegression()

In [42]:
df2 = pd.read_csv('test.csv')

In [43]:
df2.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [44]:
df3 = df2.drop(['PassengerId','Name','Ticket','Cabin','Parch','SibSp','Embarked'],axis=1)

In [45]:
df3.isnull().sum()

Pclass     0
Sex        0
Age       86
Fare       1
dtype: int64

In [46]:
df3['Age'].fillna(df3['Age'].mean(),inplace =True)
df3['Fare'].fillna(df3['Fare'].mean(),inplace =True)

In [47]:
l_sex_dummies = pd.get_dummies(df3['Sex'],drop_first =True)
df3 = pd.concat([df3,l_sex_dummies],axis=1)
df3.drop('Sex',axis =1,inplace =True)

In [49]:
df3[feature_scale] = sts.fit_transform(df3[feature_scale])

In [50]:
df3.head()

   Pclass       Age      Fare  male
0       3  0.334993 -0.498407     1
1       3  1.325530 -0.513274     0
2       2  2.514175 -0.465088     1
3       3 -0.259330 -0.483466     1
4       3 -0.655545 -0.418471     0

In [51]:
y_predict = logmodel.predict(df3)

In [53]:
submission = pd.DataFrame({
        "PassengerId": df2['PassengerId'],
        "Survived": y_predict
    })

In [54]:
submission.to_csv('titanic_submission_v02.csv', index=False)